function feiknum(keyword,validate,val,thisv){
	var validateConstant = {
		"notEmpty" : /^.+$/,// 合法字符
		"loginname" : /^[0-9A-Za-z]{4,12}$/,// 密码
		"password" : /^[0-9A-Za-z]{6,12}$/,// 密码
		"rightfulString" : /^[A-Za-z0-9_-]+$/,// 合法字符
		"number" : /^\d+$/,// 数字
		"number18" : /^\d{1,18}$/,// 数字
		"number4" : /^\d{1,4}$/,// 数字
		"endlish" : /^[A-Za-z]+$/,// 纯英文
		"numberEnglish" : /^[A-Za-z0-9]{1,28}$/,// 英文和数字
		"numberEnglish12" : /^[A-Za-z0-9]{1,12}$/,// 英文和数字
		"numberEnglish20" : /^[A-Za-z0-9]{1,20}$/,// 英文和数字
		"carnumberEnglish" : /^[A-Za-z0-9]{15,25}$/,// 英文和数字
		"float" : /^[+]?\d+(\.\d+)?$/,// 浮点型
		"money" : /(^[1-9]\d{0,9}(\.\d{1,2})?$)/,
		"chinese" : "/^[\u4e00-\u9fa5]+$/",// 纯中文
		"mobile" : /^((13[0-9]{1})|(14[5,7]{1})|(15[0-3,5-9]{1})|(17[0,3,5-8]{1})|(18[0-9]{1})|(166)|(198)|(199)|(147))+\d{8}$/,// 手机号
		"mobile2" : /^\d{6,13}$/,// 手机号
		"tel" : /^(\d{3,4}-?)?\d{7,9}$/g,// 电话
		"zipCode" : /^[0-9]{6}$/,// 邮政编码
		"cardBum" : /^[0-9]{0,8}$/,// 8位0-9
		"email" : /^([a-zA-Z0-9_-])+@([a-zA-Z0-9_-])+(.[a-zA-Z0-9_-])+/,// 邮箱
		"positive": /^\+?[1-9]\d*$/,     //大于0的整数
		"positive8": /^\+?[1-9]\d{0,8}$/,     //大于0的整数               
		"positive9": /^\+?[0-9]\d{0,8}$/,     //大于0的整数
		"limit6":/^[0-9A-Za-z\u4e00-\u9fa5]{1,6}$/,      //6位数字英文汉字
		"limit18":/^[0-9A-Za-z\u4e00-\u9fa5]{1,18}$/,      //18位数字英文汉字
		"limit24":/^[0-9A-Za-z\u4e00-\u9fa5]{1,24}$/,      //24位数字英文汉字
		"illegal6":/^[^`~!@#$%^&*()_+<>?:"{},.\/;'[\]·！#￥（——）：；“”‘、，|《。》？、【】[\]]{1,6}$/,
		"img":/.(gif|jpg|jpeg|png|gif|jpg|png)$/,          //图片文件格式
		"idcard":/^([1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$)/           //图片文件格式
	}

	var errorMsg = {
		"notEmpty" : "不能为空",
		"loginname" : "必须由4~12位数字和字母组成",// 登录名
		"password" : "密码必须由6~12位数字和字母组成",
		"rightfulString" : "请输入合法字符",// 合法字符
		"number" : "不能为空,且只能输入数字",// 数字
		"number18" : "不能为空,且只能输入数字,至多18位",// 数字
		"number4" : "不能为空,且只能输入数字,至多4位",// 数字
		"endlish" : "只能输入英文",// 纯英文
		"numberEnglish" : "不能为空,且只能输入英文或数字至多28位",// 英文和数字
		"numberEnglish12" : "不能为空,且只能输入英文或数字至多12位",// 英文和数字
		"numberEnglish20" : "不能为空,且只能输入英文或数字至多20位",// 英文和数字
		"carnumberEnglish" : "不能为空,且只能输入15~25位的英文或数字",// 英文和数字
		"float" : "不能为空,且只能输入小数",// 浮点型
		"money" : "请输入合法价格",
		"chinese" : "不能为空,且只能输入汉字",// 纯中文
		"mobile" : "请输入正确的手机号",// 手机号
		"mobile2" : "请输入正确的电话号码",// 手机号
		"tel" : "请输入正确的电话号码",// 电话
		"zipCode" : "请输入正确的QQ号",
		"cardBum" : "请输入8位内数字",
		"email" : "请输入正确的邮箱",// 邮箱
		"positive":"请输入大于0的整数",//大于0的数字
		"positive8":"请输入大于0的整数且至多8位",//大于0的数字
		"positive9":"不能为空，且至多8位",//大于0的数字
		"limit6":"不能为空，且只能输入数字英文汉字至多6位",
		"limit18":"不能为空，且只能输入数字英文汉字至多18位",
		"limit24":"不能为空，且只能输入数字英文汉字至多24位",
		"illegal6":"不能为空，不能为特殊字符，且至多输入6位",
		"img":"不能为空，且只能上传图片类型的文件",
		"idcard":"身份证号码格式不正确"
	}
    var b = val;
	if(b!=null && b!="[]"&& b!=""){
		if(!validateConstant[validate].test(b)){
			var aa = keyword+errorMsg[validate];
			$(".tips").text("");
			$(thisv).text(aa);
			$(thisv).css("color","red");
			return true;
		}
	}else{
		var aa = keyword+"不能为空";
		$(".tips").text("");
		$(thisv).text(aa);
		$(thisv).css("color","red");
		return true;
	}
}